Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetLabel Method
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetLabel(
	string label
)
Public Function SetLabel (
	label As String
) As Boolean
Parameters
label
Type: System.String
The label to set to the model object.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace